#Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.

#Пример:
#- для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]

n = int(input('Введите номер элемента ряда Фибоначчи: '))
fib = [0]*(n*2+1)
fib[n+1] = 1
for i in range(n+2, len(fib)):
    fib[i] = fib[i-1] + fib[i-2]
for i in range(n, -1, -1):
    fib[i] = fib[i+2] - fib[i+1]
print(fib)